---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimLeaderDisplayCondition
source: html/4de1295f-f8dd-d092-fed1-be7075f4b319.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimLeaderDisplayCondition Property

"Show Leader When Text Moves"

## Syntax (C#)
```csharp
public static ForgeTypeId DimLeaderDisplayCondition { get; }
```